IdeaRS.Connections
GussetPlateData.ShapeCode Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the code of the shape
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public PlateShapeCode ShapeCode { get; set; }
Property Value
Type: PlateShapeCode
See Also
Reference
GussetPlateData Class
IdeaRS.Connections.Data Namespace